benchmarks/cospec_benchmark_results_20250513_000849/baseline_1_1_12_natural-questions_output.txt
INFO 05-13 02:07:28 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='natural-questions', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=12.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=1.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 100228 samples from cache from sentence-transformers/cache/sharegpt_facebook/opt-6.7b.json
Temperature:  1.0
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     3362      
Benchmark duration (s):                  300.27    
Total input tokens:                      38596     
Total generated tokens:                  456530    
Request throughput (req/s):              11.20     
Output token throughput (tok/s):         1520.39   
Total Token throughput (tok/s):          1648.92   
---------------Time to First Token----------------
Mean TTFT (ms):                          74.58     
Median TTFT (ms):                        63.81     
P99 TTFT (ms):                           280.19    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          67.04     
Median TPOT (ms):                        68.54     
P99 TPOT (ms):                           87.76     
---------------Inter-token Latency----------------
Mean ITL (ms):                           109.44    
Median ITL (ms):                         104.67    
P99 ITL (ms):                            310.43    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          9106.34   
Median E2EL (ms):                        8051.98   
P99 E2EL (ms):                           26966.49  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 67.12     
Median Token Latency (ms):               68.64     
P99 Token Latency (ms):                  87.62     
==================================================