benchmarks/cospec_benchmark_results_20250513_000849/baseline_5_1_16_sharegpt_output.txt
INFO 05-13 04:37:39 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=16.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=1.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Temperature:  1.0
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1099      
Benchmark duration (s):                  300.44    
Total input tokens:                      254371    
Total generated tokens:                  218492    
Request throughput (req/s):              3.66      
Output token throughput (tok/s):         727.25    
Total Token throughput (tok/s):          1573.92   
---------------Time to First Token----------------
Mean TTFT (ms):                          80247.28  
Median TTFT (ms):                        81280.33  
P99 TTFT (ms):                           211711.27 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          186.64    
Median TPOT (ms):                        165.72    
P99 TPOT (ms):                           469.79    
---------------Inter-token Latency----------------
Mean ITL (ms):                           437.33    
Median ITL (ms):                         382.01    
P99 ITL (ms):                            1059.91   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          113455.39 
Median E2EL (ms):                        114301.87 
P99 E2EL (ms):                           232764.31 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 2846.45   
Median Token Latency (ms):               542.43    
P99 Token Latency (ms):                  30484.86  
==================================================