benchmarks/cospec_benchmark_results_20250513_000849/colocation_only_7_0.5_8_sharegpt_output.txt
INFO 05-13 07:24:20 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=8.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.5, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Temperature:  0.5
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1769      
Benchmark duration (s):                  300.38    
Total input tokens:                      421361    
Total generated tokens:                  374655    
Request throughput (req/s):              5.89      
Output token throughput (tok/s):         1247.27   
Total Token throughput (tok/s):          2650.03   
---------------Time to First Token----------------
Mean TTFT (ms):                          17208.55  
Median TTFT (ms):                        18114.54  
P99 TTFT (ms):                           49599.11  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          124.80    
Median TPOT (ms):                        117.24    
P99 TPOT (ms):                           345.07    
---------------Inter-token Latency----------------
Mean ITL (ms):                           411.75    
Median ITL (ms):                         381.72    
P99 ITL (ms):                            861.36    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          37941.75  
Median E2EL (ms):                        35765.36  
P99 E2EL (ms):                           108664.93 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 690.47    
Median Token Latency (ms):               195.94    
P99 Token Latency (ms):                  6522.59   
==================================================